Update README diagram and HACS badge
